In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv('Data.csv')

In [3]:
data

      City   Age     Sex Smoke  HappinessIndex Healthy
0   Mumbai  24.0    Male   Yes           241.0     Yes
1   London  80.0  Female    No           928.0      No
2  NewYork  38.0    Male   Yes             NaN     Yes
3  NewYork  22.0  Female   Yes           786.0     Yes
4  NewYork  36.0    Male   Yes           967.0     Yes
5   London   NaN  Female   Yes           665.0     Yes
6   Mumbai  17.0  Female    No           293.0      No
7  NewYork  28.0  Female    No           494.0     Yes
8   Mumbai  45.0  Female    No           707.0      No
9   London  29.0    Male   Yes           599.0      No

In [23]:
X = data.iloc[:,0:5]

In [24]:
X

      City   Age     Sex Smoke  HappinessIndex
0   Mumbai  24.0    Male   Yes           241.0
1   London  80.0  Female    No           928.0
2  NewYork  38.0    Male   Yes             NaN
3  NewYork  22.0  Female   Yes           786.0
4  NewYork  36.0    Male   Yes           967.0
5   London   NaN  Female   Yes           665.0
6   Mumbai  17.0  Female    No           293.0
7  NewYork  28.0  Female    No           494.0
8   Mumbai  45.0  Female    No           707.0
9   London  29.0    Male   Yes           599.0

In [25]:
X = X.values

In [26]:
X

array([['Mumbai', 24.0, 'Male', 'Yes', 241.0],
       ['London', 80.0, 'Female', 'No', 928.0],
       ['NewYork', 38.0, 'Male', 'Yes', nan],
       ['NewYork', 22.0, 'Female', 'Yes', 786.0],
       ['NewYork', 36.0, 'Male', 'Yes', 967.0],
       ['London', nan, 'Female', 'Yes', 665.0],
       ['Mumbai', 17.0, 'Female', 'No', 293.0],
       ['NewYork', 28.0, 'Female', 'No', 494.0],
       ['Mumbai', 45.0, 'Female', 'No', 707.0],
       ['London', 29.0, 'Male', 'Yes', 599.0]], dtype=object)

In [19]:
y = data.iloc[:,5]

In [20]:
y

0    Yes
1     No
2    Yes
3    Yes
4    Yes
5    Yes
6     No
7    Yes
8     No
9     No
Name: Healthy, dtype: object

In [21]:
y = y.values

In [22]:
y

array(['Yes', 'No', 'Yes', 'Yes', 'Yes', 'Yes', 'No', 'Yes', 'No', 'No'], dtype=object)

In [27]:
from sklearn.preprocessing import Imputer

In [31]:
imputer = Imputer(missing_values='NaN',strategy='mean',axis=0)

In [32]:
X[:,1:2] = imputer.fit_transform(X[:,1:2])
X[:,4:5] = imputer.fit_transform(X[:,4:5])

In [33]:
X

array([['Mumbai', 24.0, 'Male', 'Yes', 241.0],
       ['London', 80.0, 'Female', 'No', 928.0],
       ['NewYork', 38.0, 'Male', 'Yes', 631.1111111111111],
       ['NewYork', 22.0, 'Female', 'Yes', 786.0],
       ['NewYork', 36.0, 'Male', 'Yes', 967.0],
       ['London', 35.44444444444444, 'Female', 'Yes', 665.0],
       ['Mumbai', 17.0, 'Female', 'No', 293.0],
       ['NewYork', 28.0, 'Female', 'No', 494.0],
       ['Mumbai', 45.0, 'Female', 'No', 707.0],
       ['London', 29.0, 'Male', 'Yes', 599.0]], dtype=object)